#-*-coding:utf-8-*-
#!/usr/bin/env python
#本文档用于存储机器人的参数
#程序员：陈永厅
#版权：哈尔滨工业大学
#日期：2019.10.1
import numpy as np
from math import pi

#自制机械臂armc的DH参数表,长度单位m
# DH0_armc = np.array([[0, -pi/2, 0, 0.248],
# 					[0,  pi/2, 0, 0    ],
# 					[0, -pi/2, 0, 0.305],
# 					[0,  pi/2, 0, 0    ],
# 					[0, -pi/2, 0, 0.306],
# 					[0,  pi/2, 0, 0    ],
# 					[0,  0,    0, 0.190]])

#================自制机械臂物理参数=================#
#未加传感器DH参数
DH0_armc = np.array([[0, -pi/2, 0, 0.248],
					[0,  pi/2, 0, 0    ],
					[0, -pi/2, 0, 0.305],
					[0,  pi/2, 0, 0    ],
					[0, -pi/2, 0, 0.306],
					[0,  pi/2, 0, 0    ],
					[0,  0,    0, 0.213]])

#自制机械臂armc的DH参数表,加入了力传感器，长度单位m
DHf_armc = np.array([[0, -pi/2, 0, 0.248],
					[0,  pi/2, 0, 0    ],
					[0, -pi/2, 0, 0.305],
					[0,  pi/2, 0, 0    ],
					[0, -pi/2, 0, 0.306],
					[0,  pi/2, 0, 0    ],
					[0,  0,    0, 0.213]])

#自制机械臂armc的DH参数表,加入了力传感器，长度单位m
DHfa_armc = np.array([[0, -pi/2, 0, 0.248],
					[0,  pi/2, 0, 0    ],
					[0, -pi/2, 0, 0.305],
					[0,  pi/2, 0, 0    ],
					[0, -pi/2, 0, 0.306],
					[0,  pi/2, 0, 0    ],
					[0,  0,    0, 0.359]])

#自制机械臂armc的关节极限，单位为rad
q_min_armc = np.array([-180, -95, 180, -95, -180, -95, -180])*pi/180
q_max_armc = np.array([180, 95, 180, 95, 180, 95, 180])*pi/180
q_limit_armc = np.array([[-180, -95, -180, -95, -180, -95, -180],
						 [ 180, 95, 180, 95, 180, 95, 180]])*pi/180

#================armt机械臂物理参数=================#
#谭国灯机械臂DH参数,加入TCP工具
DHf_armt = np.array([[0, -pi/2, 0, 0.3235],
					[0,  pi/2, 0, 0.0    ],
					[0, -pi/2, 0, 0.316],
					[0,  pi/2, 0, 0.0    ],
					[0, -pi/2, 0, 0.2845],
					[0,  pi/2, 0, 0.0    ],
					[0,  0,    0, 0.308]])

#================ur5机械臂物理参数=================#
#UR5机械臂DH参数，
DH0_ur5 = np.array([[0, -pi/2, 		0, 		0.089159],
					[0, 0, 			0.425, 	0.0   	],
					[0,	0, 			0.39225,0.0	  	],
					[0,  -pi/2, 	0, 		0.10915	],
					[0, pi/2, 		0, 		0.09465 ],
					[0,  0,    		0, 		0.0823]])

#ur5关节极限
q_min_ur5 = np.array([-180,-180,-180,-180,-180,-180])*pi/180
q_max_ur5 = np.array([180,180,180,180,180,180])*pi/180

#================多机器人基坐标系在世界坐标系中的位置=================#
#机械臂1
X1 = np.array([-0.5,-0.5,1.2,0,0,pi])
#机械臂2
X2 = np.array([0.5,-0.5,1.2,0,0,0])
#机械臂3
X3 = np.array([0,0.5,1.2,0,0,0])
